Revit 2027 API
UnitTypeId.BritishThermalUnits Property
 British thermal units.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId BritishThermalUnits { get; }
Public Shared ReadOnly Property BritishThermalUnits As ForgeTypeId
	Get
public:
static property ForgeTypeId^ BritishThermalUnits {
	ForgeTypeId^ get ();
}
static member BritishThermalUnits : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
UnitTypeId Class
Autodesk.Revit.DB Namespace